# 🗺️ Maze 🗺️

## 🏛️ Тезей и Минотавъра 🏛️

След като победил царя на Атина, Егей, царят на Крит, Минос, поискал от атиняните всяка година да му изпращат по седем младежи и седем девици, които да бъдат принесени в жертва на свирепото чудовище с глава на бик и тяло на човек – **Минотавър**.  

Синът на Егей, **Тезей**, пожелал да тръгне като един от седмината младежи, за да убие Минотавъра. Той казал на баща си, че ако е успял, при завръщането си ще смени черните платна на кораба с бели.  

Минотавърът живеел в **Лабиринта**, от който никой не можел да избяга. Лабиринтът бил построен от изобретателя **Дедал**. Когато Тезей пристигнал на Крит, дъщерята на Минос, **Ариадна**, се влюбила в него и му дала навито на кълбо нишка, за да може геройът да намери обратния път навън.  

Тезей влязъл в лабиринта, убил Минотавъра и спасил младите атиняни. Но при завръщането си в Атина той забравил да вдигне белите платна и баща му, убеден че е загубил сина си, се хвърлил в морето, което по-късно било наречено **Егейско море**.  

<p align="center">
  <img src="https://www.greecel.com/wp-content/uploads/2017/03/theseus-and-minotaur.jpg" alt="Maze Example" width="400">
</p>

> Този разказ вдъхновява всички алгоритми за лабиринти в този репозиториум: **как да намерим път в лабиринт, както Тезей е намерил обратния път благодарение на нишката на Ариадна.**

---

## 🌀 Алгоритми за лабиринти 🌀

Алгоритмите са базирани на алгоритъма *DFS* (Deep-First-Search), реализира се чрез рекурсия (*backtracking*).

### ⚠️ Двата основни проблема при обхождане в лабиринт са:
1. Да се пропусне потенциален коридор, който може да е път към изхода
2. Да се зацикли в лабиринта - да се мине от там където вече е минавано

### ✅ Решение на проблемите:
1. Систематично обхождане
   - По часовниковата стрелка: North, East, South, West
   - По противоположни посоки: North, South, East, West
2. Маркер, който показва от къде е минато или от къде да не се минава

### Общ модел за обхождането
```
  // Дъно на рекурсията

  -Проверка дали се излиза от границите на лабирнита -> Върни се;
  -Проверка за недостижима клетка в лабиринта -> Върни се;
  -Проверка дали е финала -> Край;

  // Маркиране като посетено

  -visited[x][y] = true;

  // Проверка във всички посоки

  Провери на North;
  Провери на East;
  Провери на South;
  Провери на West;

  // Размаркиране на минатата клетка

  -visited[x][y] = false;

```
---
<p align="center">🌟🌟🌟🌟🌟</p>

### 1️⃣ 🧩**Path Existance** - Съществува ли път 🧩

- **Описание:** Проверява дали има поне един път от старт до край.  
- **Подход:** DFS  
- **Изход:** `true` / `false`  

---

### 2️⃣ 🧩**Path Count** - Колко пътища има 🧩

- **Описание:** Изчислява общия брой различни пътища от началото до края.  
- **Подход:** DFS + Backtracking  
- **Маркировка на клетки:** ✔️

---

### 3️⃣ 🧩 **All Paths** - Всички пътища 🧩

- **Описание:** Извежда всички възможни пътища от старт до край.  
- **Подход:** DFS + Backtracking с отпечатване на пътя при достигане на целта

---

### 4️⃣ 🧩 **Minimal Path** - Кой е най-късият път🧩

- **Описание:** Намира пътя с най-малка дължина.  
- **Подход:** DFS + Backtracking + проследяване на текущия път

---

<p align="right">
Maze Algorithms | Navigate • Solve • Escape | © 2026 Graf86X
</p>
